Autodesk.Revit.DB.BuiltInFailures.CurveFailures.TooShort
Line is too short.

Autodesk.Revit.DB.BuiltInFailures.CurveFailures.SelfIntersectingSpline
Self intersecting splines are not allowed in sketches.

Autodesk.Revit.DB.BuiltInFailures.CurveFailures.PeriodicCurveBadParams
End positions are invalid.

Autodesk.Revit.DB.BuiltInFailures.CurveFailures.LineTooShortWarning
Line is too short.

Autodesk.Revit.DB.BuiltInFailures.CurveFailures.LineTooShortError
Line is too short.

Autodesk.Revit.DB.BuiltInFailures.CurveFailures.InvalidCurveForElement
End positions are invalid.

Autodesk.Revit.DB.BuiltInFailures.CurveFailures.CurveNotEditableWarn
Lines created by massing or picking 3d path are not editable.

Autodesk.Revit.DB.BuiltInFailures.CurveFailures.CurveNotEditable
Lines created by massing or picking 3d path are not editable.

Autodesk.Revit.DB.BuiltInFailures.CurveFailures.CantKeepJoinTangent
Can't keep curve join tangent.

Autodesk.Revit.DB.BuiltInFailures.CurveFailures.CannotFindAreaScheme
Can't find new Area Scheme for Area Boundary.

Autodesk.Revit.DB.BuiltInFailures.CurveFailures
Failures about Curves and Curve-Driven Elements.